{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null, "embeddings_regularizer": null, "name": "embedding_1", "input_dim": 8112, "dtype": "int32", "batch_input_shape": [null, 200], "input_length": 200, "trainable": false, "mask_zero": false, "activity_regularizer": null, "output_dim": 200}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "kernel_size": [2], "dilation_rate": [1], "name": "conv1d_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "strides": [1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "kernel_size": [2], "dilation_rate": [1], "name": "conv1d_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "strides": [1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "trainable": true, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "trainable": true, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "trainable": true, "activity_regularizer": null, "use_bias": true}}], "class_name": "Sequential"}